[
    {
      "id": 1,
      "name": "Liderlik",
      "author": "Henry Kissinger ",
      "price": 19,
      "oldPrice": null,
      "description": "Dünün muhasebesi, yarının liderleri için bir siyasetname niteliğinde olan bu kitap, teknolojinin öngörülemeyen ilerleyişinin devlet yönetimi üzerindeki etkilerine ve gelecekte dünyayı bekleyen krizlere dair derin bir okuma yapmak isteyen herkes için bir kılavuz.",
      "starRate": 5,
      "reviewCount": 1938,
      "stock": 1881,
      "imgSource": "./images/books/nutuk.jpg",
      "type": "HISTORY"
    },
    {
      "id": 2,
      "name": "Arzın Kapısı Kudüs",
      "author": "Talha Uğurluel",
      "price": 11,
      "oldPrice": null,
      "description": "Kitapları, televizyon programları ve gezileriyle binlerce insanı keyifli bir tarih yolculuğuna çıkaran Talha Uğurluel anlatıyor.Arzın Kapısı Kudüs ilk defa kullanılan fotoğraflar ve şehir haritasıyla sizi şehrin damarlarında gezdiriyor, tam bir görsel şölen sunuyor.",
      "starRate": 4.7,
      "reviewCount": 330,
      "stock": 7,
      "imgSource": "./images/books/hayvan-ciftligi.jpg",
      "type": "NOVEL"
    },
    {
      "id": 3,
      "name": "Finans ve İyi Toplum",
      "author": "Robert J. Shiller",
      "price": 44,
      "oldPrice": null,
      "description": "Robert J. Shiller, finansal krizlerin ortaya çıkışlarını ve meydana getirdikleri yıkımları ele alırken insanı merkeze alan bir finansal sistem teklif etmiş ve bunun hem finansal kurumları daha etkili kılacağını hem de söz konusu sistemi toplumun refahı için çalışır hâle getirebileceğini ileri sürmüştür.",
      "starRate": 4.2,
      "reviewCount": 130,
      "stock": 3,
      "imgSource": "./images/books/zengin-baba-yoksul-baba.jpg",
      "type": "FINANCE"
    },
    {
      "id": 4,
      "name": "İki Dirhem Bir Çekirdek",
      "author": "Prof. Dr. İskender Pala ",
      "price": 40,
      "oldPrice": null,
      "description": "Anlatımı güzelleştirmek, savunulan fikir ve düşünceyi daha etkili kalmak üzere her dilde kalıplaşmış bazı sözler bulunur. Atasözleri, dua ve temenni cümlecikleri, sövgü ve ilençler, bilmece ve tekerlemeler... Bu tür kalıplaşmış sözler arasında, dilin bünyesinde en sık rastlanılanlar ise deyimdir. Dilin bünyesinde kalıplaşmış ve kökleşmiş olarak değişmeden kullanılan deyimler, hiç şüphe yok ki anlatıma canlılık ve güç katarlar. Bu sayede düşüncelerin ve olayların muhataba daha etkili biçimde yansıtıldığı bir gerçektir.Bazı kişilerle ilgili anılar ve hikâyeler, tarihten alınmış olaylar ve deyimlerin ortaya çıkış nedenleri arasında ön sıraları paylaşırlar. Bu bakımdan deyimlerin kaynaklarını arayıp bulmak, oldukça meşakkatli bir iştir. Bazen rastgele bir sayfada, bazen bir dipnotta, bazen de hiç ummadığınız bir el yazması sayfasında bir deyimin ortaya çıkış hikâyesiyle karşılaşmak mümkündür. Deyimlerimizin ortaya çıkış hikâyelerini bilmenin, dilimizin kültüre yansıyan yüzüne bir renk katacağı kesindir. Umarız, bu konuda daha geniş araştırma yapacaklar için bu küçük kitap bir başlangıç olur.",
      "starRate": 4.2,
      "reviewCount": 560,
      "stock": 6,
      "imgSource": "./images/books/alayci-kus.jpg",
      "type": "NOVEL"
    },
    {
      "id": 5,
      "name": "Beş Küçük Afacan",
      "author": " Edith Nesbit",
      "price": 9,
      "oldPrice": 14.5,
      "description": "Demiryolu Çocukları ile kendini dünya çocuklarına sevdiren usta kalem Edith Nesbit, gerçek ile fantastik olanı ustaca harmanlayan yazarların başında geliyor. Elinizde tuttuğunuz Beş Küçük Afacan hikâyesinde birbirinden zeki beş ufaklığın tarih öncesinde yaşayan Kum Perisi ile tanışmalarına şahit olacaksınız. Her peri gibi çocukların dileklerini yerine getiren Kum Perisi’ni sevimsiz yapan bir özelliği vardır: O dilekleri sadece bir günlüğüne gerçekleştirir. ",
      "starRate": 3.7,
      "reviewCount": 410,
      "stock": 450,
      "imgSource": "./images/books/hep-hayir-diyen-cocuk.jpg",
      "type": "CHILDREN"
    },
    {
      "id": 6,
      "name": "Avcunuzdaki Kelebek",
      "author": "Ahmet Şerif İzgören ",
      "price": 22,
      "oldPrice": null,
      "description": "Tebrikler! Çok net başka bir şey söylemem mümkün değil. Sanırım hızlı okuma rekoru kırmış olabilirim. Bu kadar duygu yüklü, bu kadar gerçekleri gözler önüne serebilen, hala umut olabileceğine dair bu kadar mesaj bir arada nasıl verilir, gerçekten tebrikler",
      "starRate": 4.3,
      "reviewCount": 145,
      "stock": 321,
      "imgSource": "./images/books/avucunuzdaki-kelebek.jpg",
      "type": "SELFIMPROVEMENT"
    },
    {
      "id": 7,
      "name": "Kumarbaz",
      "author": "Fyodor Mihayloviç Dostoyevski ",
      "price": 13,
      "oldPrice": null,
      "description": "Şu sırada neyim ben? Koskoca bir sıfır. Yarın ne olabilirim? Hiç. Yarın ölür, yeniden dirilerek yeni bir hayata başlayabilirim!.. İçimdeki insanı iyice mahvolmadan kurtaracağım.",
      "starRate": 4.3,
      "reviewCount": 173,
      "stock": 73,
      "imgSource": "./images/books/kumarbaz.jpg",
      "type": "NOVEL"
    },
  
    {
      "id": 8,
      "name": "Utangaç Ayı Monti",
      "author": "Duncan Beedie",
      "price": 16,
      "oldPrice": null,
      "description": "Evvel zaman içinde bir ayı vardı Monti’ydi onun adı. Gözlerini dikip bakmaya, herkesi seyretmeye bayılırdı. Aslında Ayı Monti kabalık etmek istemiyordu, ama öyle meraklıydı ki kendini tutamıyordu...",
      "starRate": 4.3,
      "reviewCount": 189,
      "stock": 89,
      "imgSource": "./images/books/utangac-ayi-monti.jpg",
      "type": "CHILDREN"
    },
    {
      "id": 9,
      "name": "Kara Delikler",
      "author": "Stephen Hawking",
      "price": 19,
      "oldPrice": 34.5,
      "description": "2016 yılının BBC Reith derslerinde Stephen Hawking, bütün bir ömür süren araştırmalarını on beş dakika içinde aktarma gibi gerçekten zorlu bir meydan okumayı kabul etti. Bu çok kısa süren derslerde Hawking, evrenin gizemlerini ortaya sererken, kara delikleri anladığımız takdirde uzayzamanın sırlarına erişebileceğimizi vurguluyor.",
      "starRate": 2,
      "reviewCount": 78,
      "stock": 80,
      "imgSource": "./images/books/kara-delikler.jpg",
      "type": "SCIENCE"
    },
    {
      "id": 10,
      "name": "İnsan Geleceğini Nasıl Kurar?",
      "author": "İlber Ortaylı",
      "price": 34,
      "oldPrice": 47.49,
      "description": "İnsan Geleceğini Nasıl Kurar? yaşam tecrübesini paylaşmayı vazife bilen bir entelektüelden, İlber Hoca’dan, okurlar için bir yol açma, yol yapma, kendini inşa etme ve toplumu ayağa kaldırma rehberi. Platon, Seneca, Cicero, Farabi gibi bilgelerin ilhamı eşliğinde ve Yenal Bilgici’nin sorularıyla…",
      "starRate": 4.5,
      "reviewCount": 250,
      "stock": 14,
      "imgSource": "./images/books/insan-gelecegini-nasil-kurar.jpg",
      "type": "SELFIMPROVEMENT"
    },
    {
      "id": 11,
      "name": "Hayvanlardan Tanrılara - Sapiens",
      "author": "Yuval Noah Harari ",
      "price": 52,
      "oldPrice": 65,
      "description": "İsrailli Yazar ve Tarih Profesörü Yuval Noah Harari’nin kaleme aldığı Hayvanlardan Tanrılara Sapiens, son yılların en çok ses getiren kitapları arasında yer alıyor. Başlangıçtan bugüne insanın tarihsel yolculuğunu ele alan eser, bugünü meydana getiren tüm koşulları fenni ve sosyal bilimler ışığında detaylandırıyor",
      "starRate": 4.2,
      "reviewCount": 480,
      "stock": 490,
      "imgSource": "./images/books/sapiens.jpg",
      "type": "HISTORY"
    },
    {
      "id": 12,
      "name": "Savaş ve Barış",
      "author": "Tolstoy",
      "price": 24,
      "oldPrice": null,
      "description": "Eğer herkes sadece kendi inanışları için savaşsaydı, savaş olmazdı...",
      "starRate": 4.4,
      "reviewCount": 930,
      "stock": 143,
      "imgSource": "./images/books/savas-ve-baris.jpg",
      "type": "NOVEL"
    }
  ]